[
  {
    "project": "Gigabuddy",
    "company": "Rarity Punks/Gigabuddy",
    "logo": "/images/logos/gigabuddy.svg",
    "projectUrl": "https://gigabuddy.com",
    "date": "Mar 2024",
    "image": "/images/screens/gigabuddy.jpg",
    "imageAltText": "Gigabuddy website",
    "info": "I developed the marketing website for <strong>Gigabuddy</strong>, an innovative Slack bot designed to streamline the onboarding process for new team members. The site was crafted as a concise, impactful one-page design, focused on two primary objectives: capturing potential user interest through a 'Register Interest' feature and providing information for prospective investors. <br /><br />The landing page was meticulously designed to showcase Gigabuddy's key features and benefits, emphasizing how it revolutionizes team onboarding through Slack integration.",
    "role": "Frontend Developer",
    "tech": [
      "react",
      "next.js",
      "firebase",
      "firestore",
      "mantine ui",
      "framer motion"
    ],
    "rate": 0.0
  },
  {
    "project": "Databeast",
    "company": "Rarity Punks/Gigabuddy",
    "logo": "/images/logos/gigabuddy.svg",
    "projectUrl": "https://databeast.xyz",
    "date": "Nov 2022 - Aug 2024",
    "image": "/images/screens/databeast.jpg",
    "imageAltText": "Databeast website",
    "info": "Databeast is an advanced analytics platform designed to provide real-time insights into the dynamic NFT market. Our intuitive interface leverages Chart.js to visually represent complex data through interactive charts and graphs, offering users a comprehensive understanding of NFT trends. A key feature is our live top 100 volume leaderboard, which tracks and displays the highest-performing NFTs in real-time, enabling users to stay ahead in this rapidly evolving digital asset space.",
    "role": "Frontend Developer",
    "tech": [
      "react",
      "next.js",
      "firebase",
      "firestore",
      "mantine ui",
      "framer motion",
      "marqo",
      "mobx",
      "storybook",
      "chromatic",
      "chart.js"
    ],
    "rate": 0.08
  },
  {
    "project": "Dropbeast",
    "company": "Rarity Punks/Gigabuddy",
    "logo": "/images/logos/gigabuddy.svg",
    "projectUrl": "https://dropbeast.xyz",
    "date": "Nov 2022 - Aug 2024",
    "image": "/images/screens/dropbeast.jpg",
    "imageAltText": "Dropbeast website",
    "info": "Dropbeast is an innovative platform revolutionizing the NFT ecosystem by streamlining airdrop claims and wallet farming processes. Our user-centric design offers a seamless experience, empowering users to effortlessly participate in airdrops and engage in farming activities. Leveraging Mantine components, we've crafted a consistent tabular layout that enhances usability while maintaining a sleek, modern aesthetic. Built on the robust foundation of Next.js and Firebase, Dropbeast delivers lightning-fast performance and unwavering reliability.",
    "role": "Frontend Developer",
    "tech": [
      "react",
      "next.js",
      "firebase",
      "firestore",
      "mantine ui",
      "framer motion",
      "marqo",
      "mobx",
      "storybook",
      "chromatic"
    ],
    "rate": 0.18
  },
  {
    "project": "Choose Tap",
    "company": "Hardhat",
    "logo": "/images/logos/hardhat.svg",
    "projectUrl": "https://choosetap.com.au",
    "date": "Oct 2019 - Apr 2022",
    "image": "/images/screens/choose-tap.jpg",
    "imageAltText": "Choose Tap website",
    "role": "Frontend Developer",
    "info": "As a key contributor to <strong>Yarra Valley Water</strong>'s impactful <strong>Choose Tap</strong> campaign, I spearheaded the development of an innovative website aimed at raising public awareness about plastic bottle consumption and promoting sustainable hydration practices. <br /><br />This pivotal project, which marked my debut at <strong>Hardhat</strong>, showcased my ability to create engaging digital experiences that merge education with user interaction. <br /><br />The cornerstone of the website was an immersive, scroll-based landing page featuring dynamic infographics that captivated visitors while conveying crucial information about the environmental impact of single-use plastics. I ensured that complex data was presented in an easily digestible, visually appealing format that resonated with a diverse audience. <br /><br />The crown jewel of the site was the <strong>Tap Finder</strong> map, a powerful tool that I implemented using Google Maps API integration. This feature allowed users to effortlessly locate free water refill stations across Australia, effectively removing barriers to adopting more sustainable hydration habits.",
    "tech": [
      "react",
      "gatsby",
      "datoCMS",
      "framer motion",
      "graphQL",
      "google Maps API",
      "storybook",
      "chromatic",
      "netlify"
    ],
    "rate": 0.24
  },
  {
    "project": "RMIT Open Day 2022",
    "company": "Prime Motive",
    "logo": "/images/logos/prime-motive.svg",
    "projectUrl": "https://primemotive.com.au/work/rmit-virtual-open-day-strategic-design",
    "date": "Jul 2022 - Aug 2022",
    "image": "/images/screens/rmit.jpg",
    "imageAltText": "RMIT Open Day 2022 website",
    "role": "Frontend Developer",
    "info": "The RMIT Open Day landing page was designed to engage prospective students and showcase the school through an innovative and interactive user experience.",
    "tech": [
      "react",
      "meteor",
      "graphQL",
      "gsap"
    ],
    "rate": -0.2
  },
  {
    "project": "Caravan Cleaning Melbourne",
    "company": "Freelance",
    "logo": "/images/logos/dallas-white.png",
    "projectUrl": "https://caravan-cleaning-melbourne.vercel.app",
    "date": "Jul 2024 - Sep 2024",
    "image": "/images/screens/ccm.jpg",
    "imageAltText": "Caravan Cleaning Melbourne website",
    "role": "Frontend Developer & Designer",
    "info": "I designed and built the 2024 site for CCM, doing away with their existing Wix application and providing a bespoke cms using Sanity.io, single click deployment using Vercel and faster page loading using Next.js static builds.",
    "tech": [
      "react",
      "next.js",
      "sanity.io",
      "framer motion",
      "storybook",
      "chromatic"
    ],
    "rate": -0.1
  },
  {
    "project": "Ventia",
    "company": "Hardhat",
    "logo": "/images/logos/hardhat.svg",
    "projectUrl": "https://ventia.com.au",
    "date": "Oct 2019 - Apr 2022",
    "image": "/images/screens/ventia.jpg",
    "imageAltText": "Ventia website",
    "role": "Frontend Developer",
    "info": "Ventia, a leading essential infrastructure services provider in Australia and New Zealand, underwent a significant digital transformation. As part of the development team, I contributed to rebuilding their legacy Rails site. A key aspect of this project was the introduction of React components through rails-react, a strategic decision aimed at future-proofing the platform for subsequent developers. This integration enhanced the site's flexibility and maintainability, aligning with Ventia's position as a major player in the infrastructure sector.",
    "tech": [
      "rails",
      "react",
      "storybook",
      "chromatic"
    ],
    "rate": 0.07
  },
  {
    "project": "CGU - ABN Resuce Campaign",
    "company": "Prime Motive",
    "logo": "/images/logos/prime-motive.svg",
    "projectUrl": "https://themonkeys.com.au/work/abn-rescue",
    "date": "Oct 2019 - Sep 2019",
    "image": "/images/screens/cgu.jpg",
    "imageAltText": "CGU - ABN Rescue campaign  website",
    "role": "Frontend Developer",
    "info": "In 2019, a staggering 424,144 Australian Business Numbers (ABNs) were deregistered, signaling a concerning trend in the Australian business landscape. <strong>CGU Insurance</strong>, a company with a long-standing commitment to supporting ambitious Australians, decided to take action.<br /><br />To reverse this alarming trend, <strong>Prime Motive</strong> engaged me to collaborate with their senior developer on a crucial front-end campaign site. This project was part of a larger, multi-faceted initiative dubbed  <strong>'ABN Rescue</strong>', aimed at reinvigorating Australia's entrepreneurial spirit. Working in collaboration with <strong>The Monkeys</strong>, a renowned creative agency handling television commercials (TVCs) and billboard campaigns, we embarked on a mission to rescue Australia's ambition and reignite its business landscape.<br /><br />My role as a front-end developer was pivotal in bringing the digital aspect of this campaign to life. Working closely with the senior <strong>Prime Motive</strong> developer, I contributed to crafting an engaging, responsive, and innovative website featuring a vertically scrolling animated UX that served as a central hub for information, resources, and support for struggling and aspiring business owners.<br /><br />The site featured intuitive navigation, ensuring that despite its innovative design, users could easily access the information they needed.",
    "tech": [
      "react",
      "next.js",
      "GSAP"
    ],
    "rate": 0.15
  }
]